# TopWebFillet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralT..::..TopWebFillet Property
StructuralSectionGeneralT Class See Also
---
Top Web Fillet - fillet radius at the top of web.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double TopWebFillet { get; set; }
```

Visual Basic
---
```text
Public Property TopWebFillet As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TopWebFillet {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace